Revit 2016 API
View3D.SetRenderingSettings Method
 Changes the mental ray rendering settings for this 3d view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public void SetRenderingSettings(
	RenderingSettings settings
)
Visual Basic
Public Sub SetRenderingSettings ( _
	settings As RenderingSettings _
)
Visual C++
public:
void SetRenderingSettings(
	RenderingSettings^ settings
)
Parameters
settings
Type: Autodesk.Revit.DB.RenderingSettings
 The new rendering settings to be applied to this view.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
View3D Class
Autodesk.Revit.DB Namespace